//一个整型变量。
//int a
//一个指向整型变量的指针。
//int* p
//一个指向“整型指针”的指针。
//int** p
//一个包含 10 个整型元素的数组。
//int arr[10]
//一个包含 10 个指针的数组，每个指针都指向整型变量。
//int *arr[10]
//一个指针，指向包含 10 个整型元素的数组。
//int (*p) [10]
//一个函数指针，指向“接收一个 int、返回 int”的函数。
//int (*p)(int)
//一个包含 10 个函数指针的数组，每个函数都接收一个 int 并返回 int。
// int (*arr[10])(int)
//一个指针，指向上面那种包含 10 个函数指针的数组。
//typedif int (*FuncPtr)(int);
// FuncPtr arr[10];
// FuncPtr (*p)[10] ;
// 
// 
//一个函数 apply，接收一个 int 数组首地址、元素个数以及回调函数；回调函数接收一个 int 并返回 void；apply 返回 void。
//
//一个函数指针，指向“无参数、返回 int 指针”的函数。
//
//一个包含 5 个函数指针的数组，每个函数接收两个 int 并返回 int。
//
//一个指针，指向上面包含 5 个函数指针的数组。
//
//一个函数 select，接收一个 int，返回一个函数指针；返回的函数接收两个 int 并返回 int。
//
//用 typedef 定义“接收两个 int、返回 int”的函数指针类型，并声明一个包含 4 个此类函数指针的数组。
//
//一个指向“函数指针”的指针，该函数接收两个 int 并返回 int。
//
//一个指向 3 行 4 列二维整型数组的指针。
//
//一个包含 10 个元素的数组，每个元素都是指向“包含 4 个 int 的数组”的指针。
//
//一个函数 get_parser，无参数，返回一个函数指针；该函数指针指向“接收 const char* 、返回 size_t”的函数。
//
//写出标准库函数 qsort 的声明，其中比较函数的两个参数都是 const void* 。